cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71N20.svd
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x030</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MFS</name>
                     <description>Management Frame Sent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUBR</name>
                     <description>TX Used Bit Read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TUR</name>
                     <description>Transmit Underrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to AHB Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROVR</name>
                     <description>Receive Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>HRESP Not OK</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFNZ</name>
                     <description>Pause Frame with Non-zero Pause Quantum Received</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTZ</name>
                     <description>Pause Time Zero</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFTR</name>
                     <description>Pause Frame Transmitted</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXINT</name>
                     <description>External Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFR</name>
                     <description>PTP Delay Request Frame Received</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFR</name>
                     <description>PTP Sync Frame Received</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRQFT</name>
                     <description>PTP Delay Request Frame Transmitted</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SFT</name>
                     <description>PTP Sync Frame Transmitted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFR</name>
                     <description>PDelay Request Frame Received</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFR</name>
                     <description>PDelay Response Frame Received</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRQFT</name>
                     <description>PDelay Request Frame Transmitted</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDRSFT</name>
                     <description>PDelay Response Frame Transmitted</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRI</name>
                     <description>TSU Seconds Register Increment</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPISBC</name>
                     <description>Enable RX LPI Indication</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WOL</name>
                     <description>Wake On LAN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSUTIMCOMP</name>
                     <description>TSU Timer Comparison</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAN</name>
               <description>PHY Maintenance Register</description>
               <addressOffset>0x034</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>PHY Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>WTN</name>
                     <description>Write Ten</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>REGA</name>
                     <description>Register Address</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PHYA</name>
                     <description>PHY Address</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OP</name>
                     <description>Operation</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CLTTO</name>
                     <description>Clause 22 Operation</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WZO</name>
                     <description>Write ZERO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPQ</name>
               <description>Received Pause Quantum Register</description>
               <addressOffset>0x038</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RPQ</name>
                     <description>Received Pause Quantum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPQ</name>
               <description>Transmit Pause Quantum Register</description>
               <addressOffset>0x03C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TPQ</name>
                     <description>Transmit Pause Quantum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPSF</name>
               <description>TX Partial Store and Forward Register</description>
               <addressOffset>0x040</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TPB1ADR</name>
                     <description>Transmit Partial Store and Forward Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>ENTXP</name>
                     <description>Enable TX Partial Store and Forward Operation</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPSF</name>
               <description>RX Partial Store and Forward Register</description>
               <addressOffset>0x044</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RPB1ADR</name>
                     <description>Receive Partial Store and Forward Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>ENRXP</name>
                     <description>Enable RX Partial Store and Forward Operation</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RJFML</name>
               <description>RX Jumbo Frame Max Length Register</description>
               <addressOffset>0x048</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FML</name>
                     <description>Frame Max Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HRB</name>
               <description>Hash Register Bottom</description>
               <addressOffset>0x080</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Hash Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HRT</name>
               <description>Hash Register Top</description>
               <addressOffset>0x084</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Hash Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>8</dimIncrement>
               <dimIndex>1-4</dimIndex>
               <name>GMAC_SA%s</name>
               <description>Specific Address 1 Bottom Register</description>
               <addressOffset>0x088</addressOffset>
               <register>
                  <name>SAB</name>
                  <description>Specific Address 1 Bottom Register</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SAT</name>
                  <description>Specific Address 1 Top Register</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>TIDM1</name>
               <description>Type ID Match 1 Register</description>
               <addressOffset>0x0A8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID1</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIDM2</name>
               <description>Type ID Match 2 Register</description>
               <addressOffset>0x0AC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID2</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIDM3</name>
               <description>Type ID Match 3 Register</description>
               <addressOffset>0x0B0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID3</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIDM4</name>
               <description>Type ID Match 4 Register</description>
               <addressOffset>0x0B4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID4</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WOL</name>
               <description>Wake on LAN Register</description>
               <addressOffset>0x0B8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IP</name>
                     <description>ARP Request IP Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MAG</name>
                     <description>Magic Packet Event Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARP</name>
                     <description>ARP Request IP Address</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SA1</name>
                     <description>Specific Address Register 1 Event Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTI</name>
                     <description>Multicast Hash Event Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPGS</name>
               <description>IPG Stretch Register</description>
               <addressOffset>0x0BC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FL</name>
                     <description>Frame Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SVLAN</name>
               <description>Stacked VLAN Register</description>
               <addressOffset>0x0C0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VLAN_TYPE</name>
                     <description>User Defined VLAN_TYPE Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ESVLAN</name>
                     <description>Enable Stacked VLAN Processing Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPFCP</name>
               <description>Transmit PFC Pause Register</description>
               <addressOffset>0x0C4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PEV</name>
                     <description>Priority Enable Vector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PQ</name>
                     <description>Pause Quantum</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMB1</name>
               <description>Specific Address 1 Mask Bottom Register</description>
               <addressOffset>0x0C8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Specific Address 1 Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMT1</name>
               <description>Specific Address 1 Mask Top Register</description>
               <addressOffset>0x0CC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Specific Address 1 Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSC</name>
               <description>1588 Timer Nanosecond Comparison Register</description>
               <addressOffset>0x0DC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NANOSEC</name>
                     <description>1588 Timer Nanosecond Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCL</name>
               <description>1588 Timer Second Comparison Low Register</description>
               <addressOffset>0x0E0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>1588 Timer Second Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
